# Pandas

کتابخانه‌ی پانداس برای کار با مجموعه داده‌های حجیم در ساختاری شبیه به جبررابطه و اس‌کیوال عمل می‌کند. این کتابخانه مبتنی بر کتابخانه‌ی نامپای است

In [79]:
import pandas as pd

In [2]:
pd.__version__

'2.2.3'

In [66]:
data = pd.read_csv('melb_data.csv' )

In [65]:
data

,Unnamed: 0,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,...,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
Suburb,,,,,,,,,,,,,,,,,,,,,
Abbotsford,1,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,3067.0,...,1.0,1.0,202.0,NaN,NaN,Yarra,-37.79960,144.99840,Northern Metropolitan,4019.0
Abbotsford,2,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,3067.0,...,1.0,0.0,156.0,79.0,1900.0,Yarra,-37.80790,144.99340,Northern Metropolitan,4019.0
Abbotsford,4,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,3067.0,...,2.0,0.0,134.0,150.0,1900.0,Yarra,-37.80930,144.99440,Northern Metropolitan,4019.0
Abbotsford,5,40 Federation La,3,h,850000.0,PI,Biggin,4/03/2017,2.5,3067.0,...,2.0,1.0,94.0,NaN,NaN,Yarra,-37.79690,144.99690,Northern Metropolitan,4019.0
Abbotsford,6,55a Park St,4,h,1600000.0,VB,Nelson,4/06/2016,2.5,3067.0,...,1.0,2.0,120.0,142.0,2014.0,Yarra,-37.80720,144.99410,Northern Metropolitan,4019.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
Williamstown,23540,8/2 Thompson St,2,t,622500.0,SP,Greg,26/08/2017,6.8,3016.0,...,2.0,1.0,NaN,89.0,2010.0,NaN,-37.86393,144.90484,Western Metropolitan,6380.0
Williamstown,23541,96 Verdon St,4,h,2500000.0,PI,Sweeney,26/08/2017,6.8,3016.0,...,1.0,5.0,866.0,157.0,1920.0,NaN,-37.85908,144.89299,Western Metropolitan,6380.0
Yallambie,23544,17 Amaroo Wy,4,h,1100000.0,S,Buckingham,26/08/2017,12.7,3085.0,...,3.0,2.0,NaN,NaN,NaN,NaN,-37.72006,145.10547,Northern Metropolitan,1369.0
Yarraville,23545,6 Agnes St,4,h,1285000.0,SP,Village,26/08/2017,6.3,3013.0,...,1.0,1.0,362.0,112.0,1920.0,NaN,-37.81188,144.88449,Western Metropolitan,6543.0
Yarraville,23546,33 Freeman St,4,h,1050000.0,VB,Village,26/08/2017,6.3,3013.0,...,2.0,2.0,NaN,139.0,1950.0,NaN,-37.81829,144.87404,Western Metropolitan,6543.0

In [5]:
animals = ['Tiger', 'Bear', 'Moose']
p_animals = pd.Series(animals)
p_animals

0    Tiger
1     Bear
2    Moose
dtype: object

In [6]:
type(p_animals)

pandas.core.series.Series

In [ ]:
p_animals[2]

'Bear'

In [22]:
animals = ['Tiger', 'Bear', None]
p_animals = pd.Series(animals)
p_animals

0    Tiger
1     Bear
2     None
dtype: object

In [23]:
animals = [2.0, 20, 1.5]
p_animals = pd.Series(animals)
p_animals

0     2.0
1    20.0
2     1.5
dtype: float64

In [ ]:
animals = [2.0, 20.1, None] #NaN میشه چون در اعداد نال رو NaN میکنه
p_animals = pd.Series(animals)
p_animals

0     2.0
1    20.1
2     NaN
dtype: float64

In [44]:
animals = {
    'n1': 'Tiger',
    'n2': 'Bear',
    'n3': None
}
p_animals = pd.Series(animals)
p_animals

n1    Tiger
n2     Bear
n3     None
dtype: object

In [30]:
print(p_animals.iloc[2])

None

In [ ]:
type(p_animals)

dtype('O')

In [57]:
p_animals.index

Index(['n1', 'n2', 'n3'], dtype='object')

In [58]:
p_animals.values

array(['Tiger', 'Bear', None], dtype=object)

In [98]:
p_animals = pd.Series(['Tiger', 'Bear', 'Moose'], index=['n1', 'n2', 'n3'])
p_animals

n1    Tiger
n2     Bear
n3    Moose
dtype: object

In [ ]:
p_animals['n1']

'Tiger'

In [68]:
p_animals.loc['n1']

'Tiger'

In [69]:
for item in p_animals:
    print('Salam ' + str(item))

Salam Tiger
Salam Bear
Salam None

In [ ]:
import numpy as np

np.float64(27.1)

In [77]:
animals = [2.0, 20.1, 5]
p_animals = pd.Series(animals)
np.sum(p_animals)

np.float64(27.1)

In [74]:
animals = [2.0, 20.1, 'Masoud']
p_animals = pd.Series(animals)
p_animals

0       2.0
1      20.1
2    Masoud
dtype: object

In [81]:
for index, item in p_animals.items():
    print('Salam ' + str(item) + ' ... index is ' + str(index))

Salam 2.0 ... index is 0
Salam 20.1 ... index is 1
Salam 5.0 ... index is 2

In [104]:
animals = {
    'n1': 'Tiger',
    'n2': 'Bear',
    'n3': 'Moose'
}
p_animals = pd.Series(animals)
animals = {
    'n1': 'Tiger2',
    'n2': 'Bear2',
    'n3': 'Moose2'
}
p_animals2 = pd.Series(animals)
animals = {
    'n1': 'Tiger3',
    'n2': 'Bear3',
    'n3': 'Moose3'
}
p_animals3 = pd.Series(animals)

df = pd.DataFrame([p_animals, p_animals2, p_animals3], index=['r1', 'r2', 'r3'])
df

        n1     n2      n3
r1   Tiger   Bear   Moose
r2  Tiger2  Bear2  Moose2
r3  Tiger3  Bear3  Moose3

In [ ]:
X = df["n1"]
print(type(X))

n1         4
n2     Bear3
n3    Moose3
Name: r3, dtype: object

In [94]:
df.loc['r2'].loc['n1']

'Tiger2'

In [95]:
df.loc['r1', 'n2']

'Bear'

In [112]:
df.T

       r1      r2      r3
n1  Tiger  Tiger2  Tiger3
n2   Bear   Bear2   Bear3
n3  Moose  Moose2  Moose3

In [119]:
df['n2']

r1     Bear
r2    Bear2
r3    Bear3
Name: n2, dtype: object

In [113]:
df[['n2']]

       n2
r1   Bear
r2  Bear2
r3  Bear3

In [133]:
df.loc['r2': , ['n2', 'n3']]

       n2      n3
r2  Bear2  Moose2
r3  Bear3  Moose3

In [143]:
df.drop('r1', inplace=True)

KeyError: "['r1'] not found in axis"

In [140]:
df

        n1     n2      n3
r2  Tiger2  Bear2  Moose2
r3  Tiger3  Bear3  Moose3

In [144]:
df2 = df

In [145]:
df2.drop('r2', inplace=True)

In [146]:
df2

        n1     n2      n3
r3  Tiger3  Bear3  Moose3

In [147]:
df

        n1     n2      n3
r3  Tiger3  Bear3  Moose3

In [148]:
animals = {
    'n1': 'Tiger',
    'n2': 'Bear',
    'n3': 'Moose'
}
p_animals = pd.Series(animals)
animals = {
    'n1': 'Tiger2',
    'n2': 'Bear2',
    'n3': 'Moose2'
}
p_animals2 = pd.Series(animals)
animals = {
    'n1': 'Tiger3',
    'n2': 'Bear3',
    'n3': 'Moose3'
}
p_animals3 = pd.Series(animals)

df = pd.DataFrame([p_animals, p_animals2, p_animals3], index=['r1', 'r2', 'r3'])
df

        n1     n2      n3
r1   Tiger   Bear   Moose
r2  Tiger2  Bear2  Moose2
r3  Tiger3  Bear3  Moose3

In [149]:
df3 = df[['n1', 'n2']]
df3

        n1     n2
r1   Tiger   Bear
r2  Tiger2  Bear2
r3  Tiger3  Bear3

In [150]:
df3.drop('r1', inplace=True)

C:\Users\Aria\AppData\Local\Temp\ipykernel_27812\3213769377.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3.drop('r1', inplace=True)

In [151]:
df3

        n1     n2
r2  Tiger2  Bear2
r3  Tiger3  Bear3

In [152]:
df

        n1     n2      n3
r1   Tiger   Bear   Moose
r2  Tiger2  Bear2  Moose2
r3  Tiger3  Bear3  Moose3

In [153]:
df4 = df[:]
df4

        n1     n2      n3
r1   Tiger   Bear   Moose
r2  Tiger2  Bear2  Moose2
r3  Tiger3  Bear3  Moose3

In [154]:
df4.drop('r1', inplace=True)

C:\Users\Aria\AppData\Local\Temp\ipykernel_27812\3926518910.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df4.drop('r1', inplace=True)

In [155]:
df4

        n1     n2      n3
r2  Tiger2  Bear2  Moose2
r3  Tiger3  Bear3  Moose3

In [156]:
df

        n1     n2      n3
r1   Tiger   Bear   Moose
r2  Tiger2  Bear2  Moose2
r3  Tiger3  Bear3  Moose3

In [157]:
df['n1'] = 1

In [158]:
df

    n1     n2      n3
r1   1   Bear   Moose
r2   1  Bear2  Moose2
r3   1  Bear3  Moose3

In [159]:
df['n1'] = df['n1'] * 2

In [160]:
df

    n1     n2      n3
r1   2   Bear   Moose
r2   2  Bear2  Moose2
r3   2  Bear3  Moose3

In [162]:
n2 = df['n2']
n2

r1     Bear
r2    Bear2
r3    Bear3
Name: n2, dtype: object

In [163]:
n2 += '!'

In [164]:
n2

r1     Bear!
r2    Bear2!
r3    Bear3!
Name: n2, dtype: object

In [165]:
df

    n1      n2      n3
r1   2   Bear!   Moose
r2   2  Bear2!  Moose2
r3   2  Bear3!  Moose3

In [55]:
df

    n1      n2      n3
r1   2   Bear!   Moose
r2   2  Bear2!  Moose2
r3   2  Bear3!  Moose3